app/Models/DataBaseHandler.php

SELECT *
FROM `torneos`
---
    function jls_get_tournaments_by_filter($status = null)
    {
        $builder = $this->db->table('torneos');

        switch ($status) {
            case 'ongoing':
                // Un torneo puede estar en curso, activo o inactivo.
                $builder->where('fecha_inicio <=', 'CURRENT_TIME', false)
                    ->where('fecha_fin >=', 'CURRENT_TIME', false);
                break;
            case 'active':
                $builder->where('activo', 1);
                break;
            case 'inactive':
                $builder->where('activo', 0);
                break;
            case 'finished':
                $builder->where('activo', 0)
                    ->where('fecha_fin <', date('Y-m-d H:i:s'));
                break;
            default:
                // Mostrar todos los torneos (no se aplican filtros adicionales).
                break;
        }

        $query = $builder->get();

SELECT COUNT(*) AS `numrows`
FROM `rondas`
WHERE `id_torneo` = '2'
---
    function jls_get_tournament_participants($tournament_id, $existsBracket = false)
    {
        // SELECT * FROM usuarios u WHERE NOT EXISTS (
        //     SELECT r.* FROM rondas r
        //     JOIN inscripciones i1 ON i1.id = r.id_participante1
        //     JOIN inscripciones i2 ON i2.id = r.id_participante2
        //     where r.id_torneo = $tournament_id
        //     WHERE u.id = i1.id_usuario OR u.id = i2.id_usuario)
        //Pero esta subconsulta no devuelve nada, luego la consulta entera devolvería todos los usuarios
        try {
            // Valida el ID del torneo
            if (!is_numeric($tournament_id)) {
                throw new InvalidArgumentException("El ID del torneo debe ser un valor numérico.");
            }

            // Si existe un bracket, devuelvo solo a los que no se encuentran ya seleccionados para rondas
            if ($existsBracket) {
                /**
                 * Importante aplicar esto ya que si no hay filas en rondas para el torneo dado,
                 * la subconsulta de NOT EXISTS no encontrará resultados, y todos los usuarios serán devueltos.
                 */
                $exists = $this->db->table('rondas')
                    ->where('id_torneo', $tournament_id)
                    ->countAllResults();

SELECT `u`.`id`, `u`.`alias_usuario`, `r`.`nombre` AS `rol_nombre`, `u`.`activo`, `u`.`fecha_registro`, `u`.`ultima_conexion`
FROM `usuarios` `u`
JOIN `tipos_rol` `r` ON `r`.`id` = `u`.`id_rol`
---
    function jls_get_users_by_filter($alias = null, $role = null, $status = null, $registration_start = null, $registration_end = null)
    {
        //Utilizo alias como u o r para evitar ambiguedades
        $builder = $this->db->table('usuarios u');
        $builder->select('u.id, u.alias_usuario, r.nombre AS rol_nombre, u.activo, u.fecha_registro, u.ultima_conexion'); // AS para evitar ambiguedades también
        $builder->join('tipos_rol r', 'r.id = u.id_rol');
        if ($alias && $alias != 'all') {
            $builder->like('alias_usuario', $alias);
        }
        if ($role && $role != 'all') {
            //  revisar
            $builder->where('', $role);
        }
        if ($status && $status != 'all') {
            $builder->where('activo', $status);
        }

        //Filtrado por fecha
        if ($registration_start) {
            //Buscando usuarios registrados el mismo día o después de la fecha elegida
            $builder->where('fecha_registro >=', $registration_start);
        }
        if ($registration_end) {
            //Buscando usuarios registrados el mismo día o antes de la fecha elegida
            $builder->where('fecha_registro <=', $registration_end);
        }

        $result = $builder->get();

UPDATE `usuarios` SET `id_rol` = '2'
WHERE `id` = '10'
---
    function jls_change_user_rol($user_id, $rol_id)
    {
        // Validar los parámetros
        if (!is_numeric($user_id) || $user_id <= 0 || !is_numeric($rol_id) || $rol_id <= 0) {
            return false;
        }
        try {
            $builder = $this->db->table('usuarios');
            $data = [
                'id_rol' => $rol_id
            ];
            $builder->update($data, ['id' => $user_id]);

SELECT *
FROM `tipos_ronda`
ORDER BY `id` ASC
---
    function jls_get_rounds()
    {
        try {
            $builder = $this->db->table('tipos_ronda');
            $builder->orderBy('id', 'ASC');
            $result = $builder->get();

SELECT `r`.`id`, `i1`.`alias` AS `participante1_alias`, `i2`.`alias` AS `participante2_alias`, `r`.`resultado`, `r`.`id_tipo_ronda`, `r`.`posicion_enfrentamiento`
FROM `rondas` `r`
JOIN `inscripciones` `i1` ON `r`.`id_participante1` = `i1`.`id`
JOIN `inscripciones` `i2` ON `r`.`id_participante2` = `i2`.`id`
WHERE `r`.`id_torneo` = '21'
ORDER BY `r`.`posicion_enfrentamiento` ASC
---
    function jls_get_round_info($tournament_id)
    {
        try {
            $builder = $this->db->table('rondas r');
            // $builder->select('r.id, u1.alias_usuario AS participante1_alias, u2.alias_usuario AS participante2_alias, r.resultado, r.id_tipo_ronda, r.posicion_enfrentamiento');
            $builder->select('r.id, i1.alias AS participante1_alias, i2.alias AS participante2_alias, r.resultado, r.id_tipo_ronda, r.posicion_enfrentamiento');
            // sí o sí necesito hacer dos JOIN porque estás consultando la tabla inscripciones dos veces para
            // relacionarla con diferentes campos de la tabla rondas: id_participante1 y id_participante2.
            $builder->join('inscripciones i1', 'r.id_participante1 = i1.id');
            $builder->join('inscripciones i2', 'r.id_participante2 = i2.id');
            // $builder->join('usuarios u1', 'i1.id_usuario = u1.id');
            // $builder->join('usuarios u2', 'i2.id_usuario = u2.id');
            $builder->where('r.id_torneo', $tournament_id);
            $builder->orderBy('r.posicion_enfrentamiento', 'ASC');
            $result = $builder->get();